/*********************************
文件名：kh0308.cpp
题目：8.要将"China"译成密码，密码规律是:用原来的字母后面第4个字母代替原来的字母。例如，字母A后面第4个字母是E,用E代替A。因此，"China"应译为"Glmre"请编写程序，用赋初值的方法使 c1, c2, c3, c4, c5 这5个变量的值分别为'C'，'h','i','n'，'a',经过运算，使c1,c2 ,c3,c4,c5分别变为'G'，'l', 'm', 'r'，'e',并输出。
姓名：周璨
学号：200512134
时间：2020.10.20
修改履历：
*********************************/

/*********************************
NOTE: This file is transcoded into UTF-8.
*********************************/

/*********************************
非编程类作业在此处作答
*********************************/


/******程序类作业在下面作答******/
#include <iostream>
using namespace std;

int main()
{

}
