/*********************************
文件名：kh0302.cpp
题目：2. 字符常量与字符串常量有什么区别?
姓名：周璨
学号：200512134
时间：2020.10.20
修改履历：
*********************************/

/*********************************
NOTE: This file is transcoded into UTF-8.
*********************************/

/*********************************
字符常量使用单引号引出，且单引号内只能有一个字符或者由\开头的转义序列，如 'a' 表示字符a， '\n' 表示换行符，其值为该字符的ASCII码值，占用1字节内存空间；字符串常量用双引号引出，中间可以有多个字符，特殊字符仍可以用\转义，末尾由系统自动添加'\0'用于标志字符串结束，因此在内存中占用的字节数为字符数+1，其值为指向该字符串开头的字符型指针。
*********************************/
