/*********************************
文件名：ks01.cpp（根据作业形式修改文件名，01为次数）
题目：这个是课上布置题目的示例
姓名：周璨
学号：200512134
时间：
修改履历：
**********************************/

/*********************************
文件名：kh0101.cpp（根据作业形式修改文件名，第一个01代表第一次，第二个01代表题号）
题目：这个是课后布置电子版题目的示例
姓名：周璨
学号：200512134
时间：
修改履历：
*********************************/

/*********************************
文件名：sh0101.cpp（根据作业形式修改文件名，第一个01为章节，第二个01为题号）
题目：这个是书后作业题目的示例
姓名：周璨
学号：200512134
时间：
修改履历：
*********************************/

/*********************************
NOTE: This file is transcoded into UTF-8.
*********************************/

/*********************************
非编程类作业在此处作答
*********************************/


/******程序类作业在下面作答******/
#include <iostream>
using namespace std;

int main()
{

}
