/*********************************
文件名：sy0203.cpp
题目：企业发放的奖金来自利润提成。利润i低于或等于10万元的，可提成10%为奖金;利润i高于10万元，低于或等于20万元( 1000 <iz00000时，低于10万元的部分按10%提成,高于10万元的部分可提成7.5% 20000 <i<40000时，低于20万的部分仍按上述办法提成(下同),高于20万元的部分按5%提成00000 <i600000时,高于40万元的部分按3%提00000<00000时,高于60万元的部分按1.5%提成;i>1000000时,超过100万元的部分按1%提成。从键盘输人当月利润i,求应发奖金总数。
姓名：周璨
学号：200512134
时间：2020.11.03
修改履历：
*********************************/

#include <iostream>
using namespace std;

int main()
{
	int i, j;
	cin >> i;
	switch ((i - 1) / 100000)
	{
	case 0:
		j = i + i / 10;
		break;
	case 1:
		j = i + 10000 + (i - 100000) * 75 / 1000;
		break;
	case 2:
	case 3:
		j = i + 17500 + (i - 200000) / 20;
		break;
	case 4:
	case 5:
		j = i + 27500 + (i - 400000) * 3 / 100;
		break;
	case 6:
	case 7:
	case 8:
	case 9:
		j = i + 39500 + (i - 600000) * 15 / 1000;
		break;
	default:
		j = i + 45500 + (i - 1000000) * 15 / 1000;
	}
	cout << j << endl;
}
