/*********************************
文件名：sy0303.cpp
题目：根据下述条件的逻辑表达式验证输入输出：
(1) weight大于或等于155，但小于125；
(2) ch为q或者为Q；
(3) x为偶数，但不是26的倍数；
(4) d位于1000到2000中，或g为1；
(5) ch是小写英文字母或者大写英文字母；
姓名：周璨
学号：200512134
时间：2020.11.04
修改履历：
*********************************/

/*********************************
(1) weight >= 155 && weight < 125
(2) ch == 'q' || ch == 'Q'
(3) x % 2 == 0 && x % 26
(4) d >= 1000 && d <= 2000 || g == 1
(5) (ch >= 'a' && ch <= 'z') || (ch >= 'A' && ch <= 'Z')
*********************************/
