/*********************************
文件名：kh0102.cpp
题目：2.一个C++程序是由哪几部分构成的?其中的每一部分分别起什么作用？
姓名：周璨
学号：200512134
时间：2020.10.14
修改履历：
*********************************/

/*********************************
NOTE: This file is transcoded into UTF-8.
*********************************/

#include <iostream>   //头文件引入                      ┐
using namespace std;  //声明使用的命名空间              |
                      //                                |    程
int main()            //函数头                          |
{                     //                          ┐函   ┘--┐ 序
                      //                          |        |
    cout << "Hello Zhou Can!" << endl; //输出语句 |数      | 框
                                       //         |        |
    return 0;                          //返回语句 |体   ┐--┘ 架
}                                      //         ┘     ┘
