/*********************************
文件名：kh0104.cpp
题目：4，请说明编辑、编译、连接的作用。在编译后得到的目标文件为什么不能直接运行?
姓名：周璨
学号：200512134
时间：2020.10.14
修改履历：
*********************************/

/*********************************
NOTE: This file is transcoded into UTF-8.
*********************************/

/*********************************
编辑：书写源代码，得到C++源代码文件；
编译：将C++语言源代码文件转换成计算机能读懂的机器码文件；
连接：将机器码文件与系统中相关的运行信息和库连接起来，形成一个系统可以直接执行的程序文件。
编译后的目标文件只是包含了程序的机器码，系统不知道如何将它加载到内存以及提供必要的支持，因此无法直接运行。
*********************************/
